
Процедура ПриНачалеРаботыСистемы()
	
	ПредупреждениеАсинх("Приложение на платформе 1С:Предприятие 8 готово к работе");
	
	ДатаСегодня = ТекущаяДата();
	
	ОтформатированнаяДатаСегодня = Формат(ДатаСегодня,  "ДФ=dd.MM.yy");
	
	НачалоРабочегоДня = НачалоДня(ДатаСегодня) + 9 * 60 * 60; 
	
	МинутСНачалаРабочегоДня = (ДатаСегодня - НачалоРабочегоДня) / 60;
	
	ОтформатированноеКоличествоМинут = Формат(МинутСНачалаРабочегоДня, "ЧДЦ=0");
		
	//Состояние рабочего дня
	ДеньНеделиСегодня = ДеньНедели(ДатаСегодня);
	ВремяСейчас = Час(ДатаСегодня);
	ИмяДняНеделиСегодня = Формат(ТекущаяДата(),"ДФ=дддд");
	КонецРабочегоДня = НачалоРабочегоДня + 9 * 60 *60;
	
	Если ДатаСегодня >= НачалоРабочегоДня И ДатаСегодня <= КонецРабочегоДня Тогда 
		
		РабочийДень = "идёт";
	КонецЕсли;
	
	Если ДатаСегодня > КонецРабочегоДня Тогда
		
		РабочийДень = "завершился";
		
	КонецЕсли;
	
	Если ДатаСегодня < НачалоРабочегоДня Тогда
		
		РабочийДень = "ещё не начался";
		
	КонецЕсли;	
	
	Если ДеньНеделиСегодня = 6 или ДеньНеделиСегодня = 7 Тогда
		
		ТекстСообщения = СтрШаблон("Сегодня %1, выходной день", ИмяДняНеделиСегодня);
		
	Иначе 
		
		ТекстСообщения = СтрШаблон("Сегодня %1, будний день. Рабочий день %2", ИмяДняНеделиСегодня, РабочийДень);
		СостояниеРабочегоДня = СтрШаблон("Минут с начала рабочего дня: %1", ОтформатированноеКоличествоМинут);
	КонецЕсли;
	
	Если РабочийДень = "идёт" Тогда 
		Сообщить(СостояниеРабочегоДня);
	КонецЕсли;	
	Сообщить(ТекстСообщения);	
	
	// Оповещение о праздниках
	
	ДатаЗавтра = ДатаСегодня + 24 * 60 * 60;
	
	ДатаНовогоГода = Дата("20250101");
	ДатаДняПобеды = Дата("20250509");
	ДатаВосьмоеМарта = Дата("20250308");
		
	СписокПраздников = Новый Массив;
	
	СписокПраздников.Добавить(Новый Структура("Праздник, Месяц, Число", "Новый Год", 12, 31));
	СписокПраздников.Добавить(Новый Структура("Праздник, Месяц, Число", "Восьмое марта" , 3, 8));	
	СписокПраздников.Добавить(Новый Структура("Праздник, Месяц, Число", "День Победы", 5, 9));
	
	Для Каждого ЭлМассива из СписокПраздников Цикл 
		
		Если ЭлМассива.Месяц = Месяц(ДатаСегодня) и ЭлМассива.Число = День(ДатаСегодня) Тогда
			
			Сообщить(СтрШаблон("Сегодня %1, поздравляем с Праздником!", ЭлМассива.Праздник));
			
		ИначеЕсли Месяц(ДатаЗавтра) = ЭлМассива.Месяц и День(ДатаЗавтра) = ЭлМассива.Число Тогда 
			
			Сообщить("С наступающим праздником");
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	// Поздравление текущего сотрудника с днём рождения
	
	ДеньРождения = СотрудникиВызовСервера.ДеньРождениеТекущегоПользователя();	
	Если День(ДатаСегодня) = День(ДеньРождения) и Месяц(ДатаСегодня) = Месяц(ДеньРождения) Тогда 
		
		Сообщить(СтрШаблон("Поздравляем, %1, с днём Рождения!", СотрудникиВызовСервера.СотрудникТекущегоПользователя()));
		
	КонецЕсли;	

    //Обновление версии клиента
	
	ОбновлениеИнформационнойБазыВызовСервера.ПриНачалеРаботыСистемы();

КонецПроцедуры


