Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЦеныПродажиНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныПродажиНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныПродажиНоменклатурыСрезПоследних";	
	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);  
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	ВыборкаРезультата.Следующий();		
	
	Возврат ВыборкаРезультата.Цена; 	
КонецФункции	

Функция СкидкаНаДату(Номенклатура, Дата) Экспорт

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СкидкаНаГруппу.СкидкаГруппы, 0) КАК СкидкаГруппы,
	               |	ЕСТЬNULL(СкидкаНаНоменклатуру.СкидкаНоменклатуры, 0) КАК СкидкаНоменклатуры
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Номенклатура.Ссылка КАК Ссылка,
	               |		ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0) КАК СкидкаГруппы
	               |	ИЗ
	               |		РегистрСведений.Скидки.СрезПоследних(
	               |				&Период,
	               |				НоменклатураНоменклатурнаяГруппа В
	               |					(ВЫБРАТЬ
	               |						Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |					ИЗ
	               |						Справочник.Номенклатура КАК Номенклатура
	               |					ГДЕ
	               |						Номенклатура.Ссылка = &Номенклатура)) КАК СкидкиСрезПоследних
	               |			ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |			ПО СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа
	               |	ГДЕ
	               |		Номенклатура.Ссылка = &Номенклатура) КАК СкидкаНаГруппу,
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0) КАК СкидкаНоменклатуры,
	               |		Номенклатура.Ссылка КАК Ссылка
	               |	ИЗ
	               |		РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних
	               |			ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |			ПО СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа = Номенклатура.Ссылка
	               |	ГДЕ
	               |		Номенклатура.Ссылка = &Номенклатура) КАК СкидкаНаНоменклатуру";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		Если ВыборкаРезультата.СкидкаНоменклатуры = 0 Тогда
			Скидка = ВыборкаРезультата.СкидкаГруппы;
		Иначе 
			Скидка = ВыборкаРезультата.СкидкаНоменклатуры;
		КонецЕсли	
	КонецЦИкла;		
	Возврат Скидка;	

КонецФункции	

Функция СтавкаНДСНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	
	Возврат ВыборкаЗапроса.СтавкаНДС;
КонецФункции	