
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Согласовано Тогда
		Отказ = Истина;
		Сообщить("Требуется согласовать документ");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныПродажиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекущаяСтрока Из Цены Цикл
		
		Отбор = Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура);
		Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		
		СтрокаТаблицы = Цены.НайтиСтроки(Отбор);
		
		Если СтрокаТаблицы.Количество() > 1 Тогда 
			
			Сообщить("Проведение не возможно. Обнаружены дубли номенклатуры");
			Отказ = Истина;
			
		КонецЕсли;	
		
		Движение = Движения.ЦеныПродажиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.Ответственный = Ответственный;
		Движение.Цена = ТекущаяСтрока.Цена;
		
	КонецЦикла;	
	
КонецПроцедуры
