
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбратьФайлАсинхронно();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинхронно()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	
	РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ПутьКФайлу = РезультатВыбора[0];

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВBase64(Команда)

	ДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
	Объект.СтрокаBase64 = Base64Строка(ДанныеФайла);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзBase64(Команда)
	
	
	ЗначениеИзСтроки = Base64Значение(Объект.СтрокаBase64);
	ЗначениеИзСтроки.ЗаписатьАсинх(Объект.ПутьКФайлу);
	
КонецПроцедуры
