
Процедура СформироватьПрайсЛист(ТабличныйДокумент, Ссылки) Экспорт
	
	Макет = ПолучитьМакет("ПрайсЛист");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	Шапка.Параметры.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
	
	ТабличныйДокумент.Вывести(Шапка);
	
	ТабличнаяЧастьЗаголовки = Макет.ПолучитьОбласть("ТабличнаяЧастьЗаголовок");
	ТабличныйДокумент.Вывести(ТабличнаяЧастьЗаголовки);
	
	ТабличнаяЧастьСтрока = Макет.ПолучитьОбласть("ТабличнаяЧастьСтрока");
	
	Для Каждого СсылкаНоменклатуры Из Ссылки Цикл
		
		ТабличнаяЧастьСтрока.Параметры.Товар = СсылкаНоменклатуры;
		ТабличнаяЧастьСтрока.Параметры.Цена = ПолучитьЦенуНоменклатуры(СсылкаНоменклатуры);
		ТабличныйДокумент.Вывести(ТабличнаяЧастьСтрока);
	КонецЦикла;	


КонецПроцедуры	



Функция ПолучитьЦенуНоменклатуры(СсылкаНоменклатуры)

	Отбор = Новый Структура("Номенклатура", СсылкаНоменклатуры);
	ПоследняяЗапись = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ТекущаяДата(),Отбор);
	Возврат ПоследняяЗапись.Цена;
	
КонецФункции	