Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт

	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EMailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
	ПочтовыйАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	
	Выборка = Справочники.Контрагенты.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
			
		КонецЕсли;		
			
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ФактическийАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ТелефонКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьТелефон;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEMail) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = EMailКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьEMail;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьПочтовыйАдрес) Тогда
			
			НоваяСтрокаТабличнойЧасти = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрокаТабличнойЧасти.Вид = ПочтовыйАдресКонтрагента;
			НоваяСтрокаТабличнойЧасти.Значение = КонтрагентОбъект.УдалитьПочтовыйАдрес;
			
		КонецЕсли;
		

		КонтрагентОбъект.Записать();
		
	КонецЦикла;	

КонецПроцедуры	