Функция ТолькоЦифрыВСтроке(ИНН) 
	
	Цифры = "0123456789";
	
	Для СчИНН = 1 По СтрДлина(ИНН) Цикл
		
		Символ = Сред(ИНН, СчИНН, 1);
		
		Если СтрНайти(Цифры, Символ) = 0 Тогда 
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
Функция ТолькоЦифрыВСтроке1(КПП)
	
	Цифры = "0123456789";
	
	Для СчКПП = 1 По СтрДлина(КПП) Цикл
		
		Символ = Сред(КПП, СчКПП, 1);
		
		Если СтрНайти(Цифры, Символ) = 0 Тогда 
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();

КонецПроцедуры

Процедура ОбработкапроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты)
	
	// Проверка корректного заполнения ИНН и КПП
	
	ЭтоЮридическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	ЭтоФизическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	ДлинаИНН = СтрДлина(ИНН);
	
	ДлинаКПП = СтрДлина(КПП);	
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Отказ = Ложь;
	
	ИначеЕсли ЗначениеЗаполнено(ИНН) и ЭтоЮридическоеЛицо Тогда
		
		
		
		Если  ДлинаИНН <> 10 
			
			Или Не ЗначениеЗаполнено(ИНН) Тогда 
			
			Отказ = Истина;	
			
			Сообщить("ИНН у юридического лица должен быть заполнен и иметь длину 10 символов");
			
		ИначеЕсли Не ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Отказ = Истина;
			
			Сообщить("ИНН должен состоять только из цифр");
			
		ИначеЕсли РаботаСИНН.ИННВерен(ИНН) = Ложь Тогда 
			
			Отказ = Истина;
			
			Сообщить("Контрольная проверка не пройдена");
			
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(КПП) 
			
			Или ДлинаКПП <>9 Тогда
			
			Отказ = Истина;
			
			Сообщить("Необходимо заполнить КПП, его длина должна быть 9 символов");	
			
		ИначеЕсли Не ТолькоЦифрыВСтроке1(КПП) Тогда 
			
			Отказ = Истина;
			
			Сообщить("КПП должен состоять только из цифр");
			
		КонецЕсли;	
		
		
	Иначе 
		
		Если ДлинаИНН <> 12 Или Не ЗначениеЗаполнено(ИНН) Тогда 
			
			Отказ = Истина;	
			
			Сообщить ("Значение ИНН должно быть заполнено и иметь длину 12 символов");
			
		ИначеЕсли Не ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Отказ = Истина;
			
			Сообщить("ИНН должен состоять только из цифр");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПП) Тогда
			
			Отказ = Истина;	
			
			Сообщить("Поле КПП должно быть пустым");
			
		КонецЕсли;	
		
	КонецЕсли;
		
	КонецПроцедуры
