
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)	
	//Корректное отображение организационно-правовых аббревиатур
	Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
		МассивНаименований = СтрРазделить(Объект.Наименование," ",Ложь);
		Аббревиатура = МассивНаименований.Получить(0);
		МассивНаименований.Удалить(0);
		НаименованиеБезАббревиатуры = Новый Массив();	
		
		Для Каждого ЭлементМассива Из МассивНаименований Цикл
			НаименованиеБезАббревиатуры.Добавить(ЭлементМассива);	
		КонецЦикла;	
		Если Аббревиатура = "АО" Тогда	
			Объект.ПолноеНаименование = "Акционерное общество " + СтрСоединить(НаименованиеБезАббревиатуры," ");
		ИначеЕсли Аббревиатура = "ИП" Тогда 	
			Объект.ПолноеНаименование = "Индивидуальный предприниматель " + СтрСоединить(НаименованиеБезАббревиатуры," ");
		ИначеЕсли Аббревиатура = "ООО" Тогда 	
			Объект.ПолноеНаименование = "Общество с ограниченной ответственностью " + СтрСоединить(НаименованиеБезАббревиатуры," ");	
		ИначеЕсли Аббревиатура = "УП" Тогда 	
			Объект.ПолноеНаименование = "Унитарное предприятие " + СтрСоединить(НаименованиеБезАббревиатуры," ");	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		
		Объект.КПП = Неопределено;
		Элементы.КПП.Видимость = Ложь;
	Иначе 
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе 
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры
