
Процедура ОбработкаЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровИУслугТовары.Количество КАК Количество,
	               |	ПоступлениеТоваровИУслугТовары.Цена КАК Цена,
	               |	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваровИУслугТовары
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |		ПО ПоступлениеТоваровИУслугТовары.Номенклатура = СпрНоменклатура.Ссылка
	               |ГДЕ
	               |	ПоступлениеТоваровИУслугТовары.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипНоменклатуры.Товар Тогда
			
			ДвиженияТовары = Движения.Товары.Добавить();
			ДвиженияТовары.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвиженияТовары.Номенклатура = Выборка.Номенклатура;
			ДвиженияТовары.Период = Дата;
			ДвиженияТовары.Сумма = Выборка.Цена;
			ДвиженияТовары.Количество = Выборка.Количество;
			
			//Движение по счетам 41 и 60
			ДвиженияУправленческий = Движения.Управленческий.Добавить();
			ДвиженияУправленческий.Период = Дата;
			ДвиженияУправленческий.СчетДт = ПланыСчетов.Управленческий.Товары;
			ДвиженияУправленческий.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ДвиженияУправленческий.СчетКт = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
			ДвиженияУправленческий.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;	
			ДвиженияУправленческий.Сумма = Выборка.Цена;
			ДвиженияУправленческий.Количество = Выборка.Количество;
		
		Иначе 
			
			ДвиженияРасходы = Движения.Расходы.Добавить();
			ДвиженияРасходы.Номенклатура = Выборка.Номенклатура;
			ДвиженияРасходы.Период = Дата;
			ДвиженияРасходы.Сумма = Выборка.Цена;
			
		КонецЕсли;	
		
		
		
	КонецЦикла;	
		
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвижениеВзаиморасчетСКонтрагентами = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвижениеВзаиморасчетСКонтрагентами.Контрагент = Контрагент;
	ДвижениеВзаиморасчетСКонтрагентами.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеВзаиморасчетСКонтрагентами.Период = Дата;
	ДвижениеВзаиморасчетСКонтрагентами.Сумма = СуммаДокумента;

	
КонецПроцедуры
