
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 	
	Движения.Скидки.Записывать = Истина;
	
	Для Каждого ТекущаяСтрока Из Скидки Цикл
			
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекущаяСтрока.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекущаяСтрока.Скидка;
		
	КонецЦикла;	
	

	
КонецПроцедуры

