
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Очистить();
	
	Для Каждого Строка Из Сотрудники Цикл
		
		ДвижениеЗарплата = Движения.Зарплата.Добавить();	
		ДвижениеЗарплата.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.Премия;
		ДвижениеЗарплата.Сотрудник = Строка.Сотрудник;
		ДвижениеЗарплата.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.ПериодДействияКонец = КонецМесяца(Дата);
		ДвижениеЗарплата.ПериодРегистрации = Дата;
		ДвижениеЗарплата.БазовыйПериодНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.БазовыйПериодКонец = КонецМесяца(Дата);
	    Движения.Зарплата.Записать();
	
	КонецЦикла;
	
	ПремияПроцентом();

КонецПроцедуры

Процедура ПремияПроцентом()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза,
	               |	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	               |	ЗарплатаБазаЗарплата.Показатель КАК Показатель
	               |ИЗ
	               |	РегистрРасчета.Зарплата.БазаЗарплата(
	               |			&Измерения,
	               |			&Измерения,
	               |			,
	               |			Регистратор = &Регистратор
	               |				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.НачисленияУдержания.Премия);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки-1];
		
		Сумма = Выборка.СуммаБаза * ПроцентПремии / 100;
		
		Движение.Сумма = Сумма;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры

