&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если СортироватьПоВозрастанию = Ложь Тогда
		СортироватьПоВозрастанию = Истина;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;	
		Объект.Товары.Сортировать("Сумма Убыв");	
	ИначеЕсли СортироватьПоВозрастанию = Истина Тогда
		СортироватьПоВозрастанию = Ложь;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;	
		Объект.Товары.Сортировать("Сумма");  
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком",,Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		
		Если ВыбраннаяНоменклатура.Количество() = 0 Тогда
			
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
			
		Иначе
			
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока. Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
			НайденнаяСтрока.Сумма =  НайденнаяСтрока.Цена * НайденнаяСтрока.Количество;	
		КонецЕсли;
		
	КонецЦикла;	
	
		
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	//Установка ставка НДС
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.СтавкаНДС = ЦеныВызовСервера.СтавкаНДСНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли; 
	
	ПриИЗмененииСтавкиНДС(ИзмененнаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)

	 ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	 ПриИзмененииСуммы(ИзмененнаяСтрока);

КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)

	 ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	 ПриИзмененииСуммы(ИзмененнаяСтрока);

КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)

	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);

КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)

	
	ПриИзмененииСтавкиНДС(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПриИзмененииЦены(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ПриИзмененииКоличества(Элементы.Товары.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ПриИзмененииСуммы(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ПриИзмененииНоменклатуры(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры








