
&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтбор", 0.1, Истина);

	                                                           
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
	
	Перем НайденныйЭлементОтбора, ПолеОтбора;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Родитель");
	ВыбранноеЗначение = Элементы.СписокГрупп.ТекущаяСтрока;
	РаботаСФормамиСпискаКлиент.УстановитьОтбор(Список, ПолеОтбора, ВыбранноеЗначение);	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборВСпискеЦен", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВСпискеЦен()

    Перем НайденныйЭлементОтбора, ПолеОтбора;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Номенклатура");
	ВыбранноеЗначение = Элементы.Список.ТекущаяСтрока;
	РаботаСФормамиСпискаКлиент.УстановитьОтбор(СписокЦен, ПолеОтбора, ВыбранноеЗначение);
КонецПроцедуры	
