
&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если СортироватьПоВозрастанию = Ложь Тогда
		СортироватьПоВозрастанию = Истина;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;	
		Объект.Товары.Сортировать("Сумма Убыв");	
	ИначеЕсли СортироватьПоВозрастанию = Истина Тогда
		СортироватьПоВозрастанию = Ложь;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;	
		Объект.Товары.Сортировать("Сумма");  
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком",ПараметрыОткрытия,Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		
		Если ВыбраннаяНоменклатура.Количество() = 0 Тогда
			
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
			
		Иначе
			
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока. Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
			НайденнаяСтрока.Сумма =  НайденнаяСтрока.Цена * НайденнаяСтрока.Количество;	
		КонецЕсли;
		
	КонецЦикла;	
		
	
	
КонецПроцедуры

#Область ОбратботкаИзменений
&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	//Установка цены
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		 ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		ИзмененнаяСтрока.Цена = 0;
	КонецЕсли;
	
	//УстановкиСкидки
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли;
	
	//Установка ставка НДС
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.СтавкаНДС = ЦеныВызовСервера.СтавкаНДСНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииСкидки(ИзмененнаяСтрока);
	ПриИЗмененииСтавкиНДС(ИзмененнаяСтрока);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	РасчетСуммыСтроки(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
 КонецПроцедуры	
  
&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)

	 РасчетСуммыСтроки(ИзмененнаяСтрока);
	 ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)

	 РасчетСуммыСтроки(ИзмененнаяСтрока);
	 ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)

	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)

	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	 
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные; 
	
	ПриИзмененииСуммы(ТекДанные);
	РасчетМаксимальногоКоличества(ТекДанные);
	РасчетСуммыСтроки(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммыСтроки(ИзмененнаяСтрока)

	Если ИзмененнаяСтрока = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;	  
    ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена * (1 - ИзмененнаяСтрока.Скидка / 100);

КонецПроцедуры

&НаКлиенте
Процедура РасчетМаксимальногоКоличества(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Цена = 0 Тогда 	
		Сообщить(СтрШаблон("Не указана цена для  %1", ИзмененнаяСтрока.Номенклатура));
		Возврат;	
	Иначе	
		ИзмененнаяСтрока.Количество = Окр(Формат(ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Цена,"ЧДЦ=2"),0,РежимОкругления.Окр15как10);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Интерфейс 

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииКоличества(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииЦены(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииСкидки(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ТекДанные);

КонецПроцедуры
#КонецОбласти










