Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт

	СтавкиНДС = Новый Структура("БезНДС, НДС10, НДС20", 0, 10, 20);
	Для каждого Ставка из СтавкиНДС Цикл
		
		Перечисление = СтрШаблон("Перечисление.СтавкиНДС.%1", Ставка.Ключ);
		ПеречислениеНаКлиенте = ПредопределенноеЗначение(Перечисление);
		Если ПеречислениеНаКлиенте = СтавкаНДС Тогда
			СуммаСтавкиНДС = Сумма * Ставка.Значение / (100 + Ставка.Значение);
			Возврат СуммаСтавкиНДС;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Сумма;
	
КонецФункции	