Функция НайтиИлиСоздатьОтборВСписке(Список, ПолеОтбора) Экспорт
	
	НайденныйЭлементОтбора = Неопределено;
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОтбора Тогда
			НайденныйЭлементОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НайденныйЭлементОтбора = Неопределено Тогда
		НайденныйЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
		НайденныйЭлементОтбора.Использование = Истина;
		НайденныйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Возврат НайденныйЭлементОтбора;
	
КонецФункции


Процедура УстановитьОтбор(СписокДляОтбора,ПолеОтбора, ЗначениеОтбора) Экспорт

	НайденныйЭлементОтбора = РаботаСФормамиСпискаКлиент.НайтиИлиСоздатьОтборВСписке(СписокДляОтбора, ПолеОтбора);
	НайденныйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.Использование = Истина;
	НайденныйЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	
КонецПроцедуры
