
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр Зарплата
		
	Движения.Зарплата.Очистить();

	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = Начисление;
		Движение.ПериодДействияНачало = НачалоДня(НачалоПериодаДействия);
		Движение.ПериодДействияКонец = КонецДня(КонецПериодаДействия);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
КонецПроцедуры
