
&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении()
	
	ПриИзмененииНоменклатурыНоменклатурнойГруппы(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы(ИзмененнаяСтрока)
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли;	
КонецПроцедуры