
&НаКлиенте
Процедура ПоказатьПомеченныхНаУдаление(Команда)   
	
	ПоказыватьПомеченныхНаУдаление = Не ПоказыватьПомеченныхНаУдаление;
	Элементы.ФормаПоказатьПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныхНаУдаление;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	НайденныйЭлементОтбора = РаботаСФормамиСпискаКлиент.НайтиИлиСоздатьОтборВСписке(Список, ПолеОтбора);
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.ПравоеЗначение = Ложь;
	НайденныйЭлементОтбора.Использование = Не ПоказыватьПомеченныхНаУдаление;
	
КонецПроцедуры

&НаСервере
Процедура СписокКонтактныхЛицНаСервере()
	
	ВыборкаКонтактныхЛиц = Справочники.КонтактныеЛица.Выбрать();
	
	
	Пока ВыборкаКонтактныхЛиц.Следующий() Цикл
		
		Если ВыборкаКонтактныхЛиц.Владелец.Ссылка = Элементы.Список.ТекущаяСтрока Тогда 
			ДолжностьКонтактногоЛица = ВыборкаКонтактныхЛиц.Должность;
			НаименованиеКонтактногоЛица = ВыборкаКонтактныхЛиц.Наименование;
			ТелефонКонтактногоЛица = ВыборкаКонтактныхЛиц.Телефон;
			Сообщить(СтрШаблон("%1, %2, %3", НаименованиеКонтактногоЛица, ДолжностьКонтактногоЛица, ТелефонКонтактногоЛица));
	КонецЕсли
	КонецЦикла;	 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтактныхЛиц(Команда)
	СписокКонтактныхЛицНаСервере();
КонецПроцедуры
