
Процедура ОбработкаЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Товары.Записывать = Истина;
	Движения.Товары.Очистить();
	Движения.Товары.Записать();
	
	Движения.Управленческий.Очистить();
	

	//Взаиморасчеты с контрагентами Приход
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчет = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвиженияВзаиморасчет.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвиженияВзаиморасчет.Период = Дата;
	ДвиженияВзаиморасчет.Контрагент = Контрагент;
	ДвиженияВзаиморасчет.Сумма = СуммаДокумента;
	
	//Регистр бухгалтерии Управленческий счета 90.1 и 62
	
	Движения.Управленческий.Записывать = Истина;
	ДвижениеУправленческий = Движения.Управленческий.Добавить();
	ДвижениеУправленческий.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	ДвижениеУправленческий.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	ДвижениеУправленческий.СчетКт = ПланыСчетов.Управленческий.Выручка;
	ДвижениеУправленческий.Период = Дата;
	ДвижениеУправленческий.Сумма = СуммаДокумента;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК КоличествоРеализация,
	               |	РеализацияТоваровИУслугТовары.Сумма КАК СуммаРеализация,
	               |	МИНИМУМ(РеализацияТоваровИУслугТовары.НомерСтроки) КАК НомерСтроки,
	               |	РеализацияТоваровИУслугТовары.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровИУслугТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслугТовары.Номенклатура,
	               |	РеализацияТоваровИУслугТовары.Номенклатура.ТипНоменклатуры,
	               |	РеализацияТоваровИУслугТовары.Сумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура КАК Номенклатура,
	               |	ВТ_Товары.КоличествоРеализация КАК КоличествоРеализация,
	               |	ВТ_Товары.СуммаРеализация КАК СуммаРеализация,
	               |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	               |	ВТ_Товары.НоменклатураТипНоменклатуры КАК ТипНоменклатуры,
	               |	ЕСТЬNULL(УправленческийОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокБухгалтерия,
	               |	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстатокБухгалтерия,
	               |	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
	               |				&Дата,
	               |				Счет = &Счет,
	               |				&Cубконто,
	               |				Субконто1 В
	               |					(ВЫБРАТЬ
	               |						ВТ_Товары.Номенклатура КАК Номенклатура
	               |					ИЗ
	               |						ВТ_Товары КАК ВТ_Товары)) КАК УправленческийОстатки
	               |		ПО ВТ_Товары.Номенклатура = УправленческийОстатки.Субконто1,
	               |	РегистрНакопления.Товары.Остатки(
	               |			&Дата,
	               |			Номенклатура В
	               |				(ВЫБРАТЬ
	               |					ВТ_Товары.Номенклатура КАК Номенклатура
	               |				ИЗ
	               |					ВТ_Товары КАК ВТ_Товары)) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Cубконто", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ЗАпрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.Товары);
		
	РезультатЗапроса= Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.Доходы.Записывать = Истина;
	
	Движения.Товары.Записывать = Истина; 
	
	Движения.Расходы.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ДвижениеДоходы.Период = Дата;
		ДвижениеДоходы.Номенклатура = Выборка.Номенклатура;
		ДвижениеДоходы.Количество = Выборка.КоличествоРеализация;
		ДвижениеДоходы.Сумма = Выборка.СуммаРеализация;
		
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипНоменклатуры.Товар Тогда
			
			ДвижениеТовары = Движения.Товары.Добавить();
		    ДвижениеТовары.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовары.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеТовары.Период = Дата;
			
			Если Выборка.КоличествоОстаток >= Выборка.КоличествоРеализация Тогда
				
				ДвижениеТовары.Количество = Выборка.КоличествоРеализация;			
				
				Если Выборка.КоличествоОстаток = Выборка.КоличествоРеализация Тогда
					
					СуммаРасхода = Выборка.СуммаОстаток;
					РасходБухгалтерия = Выборка.СуммаОстатокБухгалтерия;
					ДвижениеТовары.Сумма = СуммаРасхода;
					
				Иначе                                                 	
					
					Себестоимость = Выборка.СуммаОстаток / Выборка.КоличествоОстаток;
					СебестоимостьДляБухгалтерии = Выборка.СуммаОстатокБухгалтерия / Выборка.КоличествоОстатокБухгалтерия;
					РасходБухгалтерия = СебестоимостьДляБухгалтерии * Выборка.КоличествоРеализация;
					СуммаРасхода = Себестоимость * Выборка.КоличествоРеализация;
					ДвижениеТовары.Сумма = СуммаРасхода;
					
				КонецЕсли;
				
			Иначе 
				
				НедостатокТовара = Выборка.КоличествоРеализация - Выборка.КоличествоОстаток;
				ШаблонСообщения = "Товара %1 недостаточно на складе. В количестве: %2";
				Сообщение = Новый СообщениеПользователю;
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Текст = СтрШаблон(ШаблонСообщения,
					Выборка.Номенклатура,
					НедостатокТовара);
				ШаблонПоле = "Товары[%1].Количество";	
				Сообщение.Поле = СтрШаблон(ШаблонПоле, XMLСтрока(Выборка.НомерСтроки -1));	
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;	
			
			ДвижениеРасходы = Движения.Расходы.Добавить();
			ДвижениеРасходы.Период = Дата;
			ДвижениеРасходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеРасходы.Сумма = СуммаРасхода;
			
			//Движение по счетам 90.2 и 41
			ДвижениеУправленческий = Движения.Управленческий.Добавить();
			ДвижениеУправленческий.СчетДт = ПланыСчетов.Управленческий.Расходы;
			ДвижениеУправленческий.СчетКт = ПланыСчетов.Управленческий.Товары;
			ДвижениеУправленческий.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ДвижениеУправленческий.Сумма = РасходБухгалтерия; 
			ДвижениеУправленческий.Период = Дата;
			ДвижениеУправленческий.Количество = Выборка.КоличествоРеализация;
		КонецЕсли;
		
		
	КонецЦикла;	
	
КонецПроцедуры
