Функция ИННВерен(Знач ИНН) Экспорт

	Если СтрДлина(ИНН) = 10 Тогда 
		
		КонтрольнаяСумма = 0;
		Для Сч = 1 по 9 Цикл
				
				Если Сч = 1 Тогда
				Множитель = 2;
			ИначеЕсли Сч = 2 Тогда
				Множитель = 4;
			ИначеЕсли Сч = 3 Тогда
				Множитель = 10;
			ИначеЕсли Сч = 4 Тогда
				Множитель = 3;
			ИначеЕсли Сч = 5 Тогда
				Множитель = 5;
			ИначеЕсли Сч = 6 Тогда
				Множитель = 9;
			ИначеЕсли Сч = 7 Тогда
				Множитель = 4;
			ИначеЕсли Сч = 8 Тогда
				Множитель = 6;
			ИначеЕсли Сч = 9 Тогда
				Множитель = 8;
			КонецЕсли;
			
        	Число = Сред(ИНН,Сч,1);
			КонтрольнаяСумма = КонтрольнаяСумма + Число * Множитель;
		КонецЦикла;
		КонтрольныйРазряд = КонтрольнаяСумма%11;
		Если КонтрольныйРазряд = 10 Тогда 
			КонтрольныйРазряд = 0;	
		ИначеЕсли КонтрольныйРазряд = Число(Сред(ИНН,10,1)) Тогда
			Возврат Истина;
		Иначе 
			Возврат Ложь;
		КонецЕсли;	
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;		
КонецФункции	