
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборПоКонтрагенту", 0.1, Истина);

КонецПроцедуры
                                                                           	
&НаКлиенте 
Процедура УстановитьОтборПоКонтрагенту()

	ПолеОтбора = Новый ПолеКомпоновкиДанных("Контрагент");
	ВыбранноеЗначение = Объект.Владелец;
	РаботаСФормамиСпискаКлиент.УстановитьОтбор(Список, ПолеОтбора, ВыбранноеЗначение);


КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	 УстановитьОтборПоКонтрагенту();
	 
КонецПроцедуры
