
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
		
	Если ВидФормы = "ФормаОбъекта" 
		И ПравоДоступа("Администрирование", Метаданные) Тогда 
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаАдминистратора;
			СтандартнаяОбработка = Ложь;
	ИначеЕсли ВидФормы = "ФормаФормаОбъекта" 
		и НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаПользователя;   
			СтандартнаяОбработка = Ложь;
	КонецЕсли;	
	    
КонецПроцедуры
