
&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьФайлФотоАсинх();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлФотоАсинх()

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите фотографию";
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Фильтр = "Картинки |*.jpg; *.png";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога, УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АдресФото = ОписаниеФайла.Адрес;
 	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	 ДвДанныеФотографии = ПолучитьИзВременногоХранилища(АдресФото);
	 ДанныеВХранилище = Новый ХранилищеЗначения(ДвДанныеФотографии);
	 ТекущийОбъект.Фотография = ДанныеВХранилище;
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДвоичныеДанныеФотографии = ТекущийОбъект.Фотография.Получить();
	АдресФото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФотографии, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	АдресРезультата = ПодготовитьКартинку(АдресФото, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьКартинку(АдресФото, УникальныйИдентификатор)

 	ДВДанныйИзображения = ПолучитьИзВременногоХранилища(АдресФото);
	
	Если ДВДанныйИзображения = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Фотография не добавлена";
		Сообщение.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	Картинка = Новый Картинка(ДВДанныйИзображения);
	
	Если Картинка.Ширина() = 100 Тогда 
		Возврат АдресФото;
	КонецЕсли;
	
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	
	ОбрабатываемаяКартинка.УстановитьРазмер(100, Неопределено);
	
	ДВДанныйИзображения = Картинка.ПолучитьДвоичныеДанные();
	
	АдресОбработаннойКартинки = ПоместитьВоВременноеХранилище(ДВДанныйИзображения, УникальныйИдентификатор);
	
	Возврат АдресОбработаннойКартинки;



КонецФункции	























