
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотрудники.Оклад КАК Оклад,
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Документ.НачислениеПоОкладу.Сотрудники КАК НачислениеПоОкладуСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО НачислениеПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	НачислениеПоОкладуСотрудники.Сотрудник.Ссылка = Сотрудники.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвижениеЗарплата = Движения.Зарплата.Добавить();
		ДвижениеЗарплата.ВидРасчета = ПланыВидовРасчета.НачисленияУдержания.ОплатаПоОкладу;
		ДвижениеЗарплата.Сотрудник = Выборка.Сотрудник;
		ДвижениеЗарплата.ПериодРегистрации = Дата;
		ДвижениеЗарплата.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвижениеЗарплата.ПериодДействияКонец = КонецМесяца(Дата);
		ДвижениеЗарплата.Показатель = Выборка.Оклад; 
		Движения.Зарплата.Записать();
		
	КонецЦИкла;				
	
	Для Каждого Движение Из Движения.Зарплата Цикл
		
		Отбор = Новый Структура("Регистратор, Сотрудник", Ссылка, Движение.Сотрудник);
		Норма = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ПериодДействия)[0].РабочихДней;
		Факт = РегистрыРасчета.Зарплата.ПолучитьДанныеГрафика(Отбор,
		ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].РабочихДней;
		
		Движение.Сумма = Движение.Показатель * Факт / Норма;
		
	КонецЦикла;	
	
	Движения.Зарплата.Записать(,Истина);	
	
КонецПроцедуры
