
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетСКонтрагентами.Записывать = Истина;
	ДвиженияВзаиморасчет = Движения.ВзаиморасчетСКонтрагентами.Добавить();
	ДвиженияВзаиморасчет.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвиженияВзаиморасчет.Контрагент = Плательщик;
	ДвиженияВзаиморасчет.Сумма = Сумма;
	ДвиженияВзаиморасчет.Период = Дата;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = СотрудникиВызовСервера.СотрудникТекущегоПользователя();
	
КонецПроцедуры
