Процедура ПринятьКИсполнению(Задача) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задача.Выполнена КАК Выполнена,
	|	Задача.Исполнитель КАК Исполнитель
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	#Область УсловияВыполненияКоманды
	
	Если Не Выборка.Следующий() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана задача";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если Выборка.Выполнена Тогда
		
		Сообщение =	Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 уже выполнена", Задача);
		Сообщение.КлючДанных = Задача;
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;	
	
	Если Выборка.Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Вы уже приняли задачу %1 к исполнению", Задача);
		Сообщение.КлючДанных = Задача;
		Сообщение.Поле = "Исполнитель";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Исполнитель) 
		И Выборка.Исполнитель <> ПараметрыСеанса.СотрудникТекущегоПользователя Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 принял к исполнению сотрудник: %2", Задача, Выборка.Исполнитель);
		Сообщение.Поле = Задача;
		Сообщение.ПутьКДанным = "Исполнитель";
		Сообщение.Сообщить();
		Возврат;

	КонецЕсли;	
	
	#КонецОбласти
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Исполнитель = ПараметрыСеанса.СотрудникТекущегоПользователя;
	ЗадачаОбъект.Записать();
	
	
КонецПроцедуры	

Процедура ОтказатьсяОтИсполненияЗадачи(Задача) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задача.Выполнена КАК Выполнена,
	|	Задача.Исполнитель КАК Исполнитель
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	#Область УсловияВыполненияКоманды
	
	Если Не Выборка.Следующий() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана задача";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	Если Выборка.Выполнена Тогда
		
		Сообщение =	Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 уже выполнена", Задача);
		Сообщение.КлючДанных = Задача;
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(Выборка.Исполнитель) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 ещё не принята к исполнению", Задача);
		Сообщение.Поле = Задача;
		Сообщение.ПутьКДанным = "Исполнитель";
		Сообщение.Сообщить();
		Возврат;
	
	КонецЕсли;	
	
	Если Выборка.Исполнитель <> ПараметрыСеанса.СотрудникТекущегоПользователя Тогда
		
		Сообщение =	Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Задача %1 выполняет сотрудник: %2", Задача, Выборка.Исполнитель);
		Сообщение.КлючДанных = Задача;
		Сообщение.ПутьКДанным = "Исполнитель";
		Сообщение.Сообщить();
		Возврат;
	
	КонецЕсли;
	
	#КонецОбласти
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
	ЗадачаОбъект.Записать();
	
	
КонецПроцедуры
	