
&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОтборСтрок = Новый Структура("Номенклатура", Значение);
	НайденныеСтрокиВСпискеВыбора = СписокВыбранныхЗначений.НайтиСтроки(ОтборСтрок);
	
	Если НайденныеСтрокиВСпискеВыбора.Количество() = 0 Тогда
		
		НоваяСтрокаТаблицы = СписокВыбранныхЗначений.Добавить();
		НоваяСтрокаТаблицы.Номенклатура = Значение;
		НоваяСтрокаТаблицы.Количество = 1;
		
	Иначе
		
		НайденнаяСтрока = НайденныеСтрокиВСпискеВыбора[0];
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныеДанные = Новый Массив;
	
	Для Каждого Строка Из СписокВыбранныхЗначений Цикл 
		
		ОписаниеВыбранногоЗначения = Новый Структура("Номенклатура, Количество");
		ЗаполнитьЗначенияСвойств(ОписаниеВыбранногоЗначения,Строка);
		
		ВыбранныеДанные.Добавить(ОписаниеВыбранногоЗначения);
	КонецЦикла;
	
	ОповеститьОВыборе(ВыбранныеДанные);
	
КонецПроцедуры
