
&НаКлиенте
Функция ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		 Возврат ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат 0;
	КонецЕсли;	

КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Согласовано Тогда 
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Номер_Дата.Доступность = Ложь;
		Элементы.Цены.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Цены.ТекущиеДанные;
	ТекДанные.Цена = Ждать ПриИзмененииНоменклатуры(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОтбора, Элементы.Цены); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", ВыбранноеЗначение);
	НайденныеСтроки = Объект.Цены.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда  
		
		ПоказатьПредупреждение(,"Выбранная номенклатура уже есть в списке",,"Обнаружены дубли номенклатуры!");
		Возврат;
		
	КонецЕсли; 
		
	НоваяСтрокаТЧ = Объект.Цены.Добавить(); 
	НоваяСтрокаТЧ.Номенклатура = ВыбранноеЗначение;
	НоваяСтрокаТЧ.Цена = ПриИзмененииНоменклатуры(НоваяСтрокаТЧ);
	 	
	
КонецПроцедуры                                        
	 	 
